vmux0.0.10/hotelReservation_vmux-dpdk-e810_19vms_256rps_rep1.log
Running 1m test @ http://10.1.0.21:5000
  8 threads and 16 connections

  Thread calibration: mean lat.: 5.423ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.299ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 4.968ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.651ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 5.517ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.928ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 5.441ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.369ms, rate sampling interval: 22ms

-----------------------------------------------------------------------
Test Results @ http://10.1.0.21:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.50ms    4.56ms  19.10ms   82.42%
    Req/Sec    32.24     37.29   142.00     83.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.31ms
 75.000%    8.62ms
 90.000%   12.03ms
 99.000%   19.10ms
 99.900%   27.89ms
 99.990%   38.65ms
 99.999%   50.72ms
100.000%   50.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.691     0.000000            1         1.00
       1.581     0.100000         1301         1.11
       1.729     0.200000         2593         1.25
       1.963     0.300000         3888         1.43
       2.919     0.400000         5187         1.67
       3.313     0.500000         6483         2.00
       3.641     0.550000         7132         2.22
       4.363     0.600000         7778         2.50
       6.499     0.650000         8424         2.86
       7.863     0.700000         9072         3.33
       8.623     0.750000         9721         4.00
       9.063     0.775000        10046         4.44
       9.511     0.800000        10372         5.00
      10.015     0.825000        10697         5.71
      10.591     0.850000        11021         6.67
      11.271     0.875000        11342         8.00
      11.655     0.887500        11502         8.89
      12.031     0.900000        11668        10.00
      12.431     0.912500        11830        11.43
      12.919     0.925000        11991        13.33
      13.471     0.937500        12151        16.00
      13.767     0.943750        12231        17.78
      14.119     0.950000        12313        20.00
      14.479     0.956250        12393        22.86
      14.927     0.962500        12475        26.67
      15.423     0.968750        12556        32.00
      15.719     0.971875        12596        35.56
      16.071     0.975000        12637        40.00
      16.511     0.978125        12677        45.71
      16.991     0.981250        12718        53.33
      17.663     0.984375        12760        64.00
      18.031     0.985938        12778        71.11
      18.495     0.987500        12798        80.00
      18.863     0.989062        12819        91.43
      19.359     0.990625        12839       106.67
      20.143     0.992188        12859       128.00
      20.559     0.992969        12869       142.22
      21.215     0.993750        12879       160.00
      21.679     0.994531        12890       182.86
      22.207     0.995313        12901       213.33
      22.879     0.996094        12910       256.00
      23.023     0.996484        12915       284.44
      23.471     0.996875        12921       320.00
      23.855     0.997266        12925       365.71
      24.447     0.997656        12930       426.67
      24.911     0.998047        12935       512.00
      26.303     0.998242        12938       568.89
      26.703     0.998437        12940       640.00
      27.695     0.998633        12943       731.43
      27.791     0.998828        12945       853.33
      28.319     0.999023        12948      1024.00
      28.399     0.999121        12949      1137.78
      29.871     0.999219        12950      1280.00
      31.375     0.999316        12952      1462.86
      32.143     0.999414        12953      1706.67
      33.759     0.999512        12954      2048.00
      33.791     0.999561        12955      2275.56
      33.791     0.999609        12955      2560.00
      34.495     0.999658        12956      2925.71
      34.879     0.999707        12957      3413.33
      34.879     0.999756        12957      4096.00
      35.391     0.999780        12958      4551.11
      35.391     0.999805        12958      5120.00
      35.391     0.999829        12958      5851.43
      38.655     0.999854        12959      6826.67
      38.655     0.999878        12959      8192.00
      38.655     0.999890        12959      9102.22
      38.655     0.999902        12959     10240.00
      38.655     0.999915        12959     11702.86
      50.719     0.999927        12960     13653.33
      50.719     1.000000        12960          inf
#[Mean    =        5.496, StdDeviation   =        4.559]
#[Max     =       50.688, Total count    =        12960]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  15553 requests in 1.02m, 17.23MB read
Requests/sec:    254.79  
Transfer/sec:    289.03KB
AUTOTEST_DONE